{
  "weekly_top_story": {
    "headline": "Chinese President Xi Jinping to host over 20 world leaders at SCO summit in Tianjin, strengthening Global South solidarity",
    "summary": "President Xi Jinping is convening leaders from Central Asia, South Asia, Southeast Asia, and the Middle East at the Shanghai Cooperation Organisation summit in Tianjin, enhancing cooperation and diplomatic collaboration among Global South nations.",
    "source": "Leverage Edu",
    "importance": 5,
    "impact_to_me": 4,
    "category": "Global",
    "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-27-august-2025/"
  },
  "stories": [
    {
      "headline": "SpaceX launches Starship megarocket on tenth test flight after previous setbacks",
      "summary": "SpaceX successfully launched its Starship megarocket in a strong test flight, overcoming earlier fiery failures and signaling progress in commercial spaceflight and exploration capabilities.",
      "source": "NDTV World News",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Science",
      "url": "https://www.ndtv.com/world-news/space-launch-spacex-starship/test-flight-2025-august"
    },
    {
      "headline": "Australia expels Iran’s ambassador amid antisemitic attacks linked to Israel-Gaza conflict",
      "summary": "In response to a rise in antisemitic vandalism and arson in Sydney and Melbourne amid the Israel-Gaza conflict, Australia expelled Iran’s ambassador, highlighting escalating geopolitical tensions and security concerns.",
      "source": "Leverage Edu",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-27-august-2025/"
    },
    {
      "headline": "Japan doubles investment in India to $68 billion over next decade",
      "summary": "Japan announced it will increase its investment in India to $68 billion over the coming ten years, reinforcing economic ties and boosting developmental projects between the two countries.",
      "source": "Leverage Edu",
      "importance": 3,
      "impact_to_me": 3,
      "category": "Business",
      "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-27-august-2025/"
    }
  ]
}