{
  "weekly_top_story": {
    "headline": "UN Security Council lifts sanctions on Syrian President Ahmed al-Sharaa and Interior Minister Anas Khattab",
    "summary": "The UN Security Council's decision to lift sanctions on key Syrian officials marks a significant shift in international engagement with Syria, potentially impacting regional diplomacy and reconstruction efforts.",
    "source": "Leverage Edu",
    "importance": 5,
    "impact_to_me": 4,
    "category": "Global",
    "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-8-november-2025/"
  },
  "stories": [
    {
      "headline": "Tesla CEO Elon Musk awarded historic $1 trillion salary, approved by 75% of shareholders",
      "summary": "Tesla shareholders approved a pay package for Elon Musk worth nearly $1 trillion contingent on corporate performance, setting a record in executive compensation with broad implications for corporate governance and tech industry leadership.",
      "source": "Leverage Edu",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Business",
      "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-8-november-2025/"
    },
    {
      "headline": "Mexico and France announce plan to boost economic and cultural ties after leaders meet",
      "summary": "Mexico and France launched a new phase of strategic alliance to expand trade, investment, scientific, and cultural cooperation, signaling strengthened bilateral relations with potential economic benefits.",
      "source": "ABC News",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://abcnews.go.com/International"
    },
    {
      "headline": "Nigeria’s army chief promises to step up anti-terror operations",
      "summary": "The new army chief of Nigeria pledged intensified counterterrorism efforts in the northern regions to combat insurgency, affecting regional security and stability in West Africa.",
      "source": "ABC News",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://abcnews.go.com/International"
    }
  ]
}