{
  "weekly_top_story": {
    "headline": "Powerful earthquake in Afghanistan kills over 800, rescue operations underway",
    "summary": "A devastating earthquake struck southeastern Afghanistan causing over 800 deaths and widespread destruction, triggering extensive rescue efforts amid difficult mountainous terrain and regional tremors felt as far as Islamabad, indicating severe humanitarian consequences and regional instability.",
    "source": "Leverage Edu",
    "importance": 5,
    "impact_to_me": 4,
    "category": "Global",
    "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-2-september-2025/"
  },
  "stories": [
    {
      "headline": "Chinese President Xi Jinping urges SCO nations to reject Cold War mentality",
      "summary": "At the Shanghai Cooperation Organisation summit, Xi Jinping called for enhanced regional cooperation and warned against Cold War-era divisions, emphasizing the need for unity and shared development among member states.",
      "source": "Indian Express",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://indianexpress.com/article/education/school-assembly-news-headlines-today-september-2-modi-xi-jingping-meet-russianpresident-putin-ncert-foundation-day-national-world-news-rupee-to-dollar-10224249/"
    },
    {
      "headline": "Indian rupee hits historic low, breaching 88 per US dollar amid global pressures",
      "summary": "The Indian rupee reached a record low against the US dollar driven by global uncertainties, rising crude prices, and trade tensions, intensifying concerns over inflation and compelling the Reserve Bank of India to consider market interventions.",
      "source": "India Today",
      "importance": 4,
      "impact_to_me": 4,
      "category": "Business",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/top-news-headlines-for-school-assembly-september-2-2780101-2025-09-02"
    },
    {
      "headline": "India and China leaders meet amid regional diplomatic balancing at SCO Summit",
      "summary": "Prime Minister Narendra Modi and President Xi Jinping met on the sidelines of the SCO Summit, marking a strategic engagement aimed at maintaining regional stability and emphasizing India's independent foreign policy stance in a complex geopolitical context.",
      "source": "Economic Times",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://economictimes.com/news/new-updates/school-assembly-news-headlines-for-september-2-top-national-international-sports-and-business-updates/articleshow/123635798.cms"
    }
  ]
}