{
  "weekly_top_story": {
    "headline": "Nepal Prime Minister KP Sharma Oli resigns following violent youth-led protests against social media ban and corruption",
    "summary": "Nepal's Prime Minister resigned after two days of intense Gen Z-led demonstrations demanding anti-corruption reforms, sparked by a controversial social media ban, highlighting growing youth activism and political volatility in the region.",
    "source": "Leverage Edu",
    "importance": 5,
    "impact_to_me": 3,
    "category": "Global",
    "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-10-september-2025/"
  },
  "stories": [
    {
      "headline": "Israel orders full evacuation of Gaza City ahead of planned military operation",
      "summary": "The Israeli military has issued a directive for all residents in Gaza City to evacuate as it prepares a major offensive against Hamas strongholds, raising serious concerns over civilian safety and regional stability.",
      "source": "ABC News",
      "importance": 5,
      "impact_to_me": 4,
      "category": "Global",
      "url": "https://abcnews.go.com/International/israeli-military-issues-full-evacuation-order-gaza-city/story?id=10357982"
    },
    {
      "headline": "At least 60 killed in overnight Islamic State-linked rebel attack in eastern Congo",
      "summary": "A brutal attack by an Islamic State-affiliated group in eastern Congo resulted in at least 60 deaths, highlighting ongoing security challenges and instability in the region.",
      "source": "ABC News",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://abcnews.go.com/International/at-least-60-killed-overnight-rebel-attack-eastern/story?id=10358010"
    },
    {
      "headline": "US and India to resume trade barrier negotiations, says former US President Donald Trump",
      "summary": "Donald Trump announced that the United States and India will continue negotiations to resolve trade barriers, signaling potential for improved economic ties and international trade flow between the two major economies.",
      "source": "NDTV via YouTube",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Business",
      "url": "https://www.youtube.com/watch?v=JS7WGFJ10zg"
    }
  ]
}