{
  "weekly_top_story": {
    "headline": "Major Israeli raid escalates Middle East tensions as Pope Leo XIV appeals for peace and global protests erupt over Gaza bombardments",
    "summary": "A significant Israeli military operation triggered heightened regional hostilities, prompting global calls for peace and widespread protests condemning the violence, potentially impacting international diplomatic efforts and stability in the Middle East.",
    "source": "FreeJobAlert",
    "importance": 5,
    "impact_to_me": 4,
    "category": "Global",
    "url": "https://www.freejobalert.com/article/school-assembly-news-headlines-today-29th-august-2025-top-national-world-sports-and-business-news-16221"
  },
  "stories": [
    {
      "headline": "Russian missile and drone strike on Kyiv kills 14 and injures 48 amid ongoing conflict",
      "summary": "A large-scale coordinated Russian attack targeting Ukraine's capital resulted in numerous casualties and injuries, marking a severe escalation in the ongoing conflict and affecting regional security dynamics.",
      "source": "FreeJobAlert",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://www.freejobalert.com/article/school-assembly-news-headlines-today-29th-august-2025-top-national-world-sports-and-business-news-16221"
    },
    {
      "headline": "Denmark confronts US over claims to influence Greenland’s status",
      "summary": "Denmark formally challenges US actions seen as attempts to exert influence over Greenland, raising questions about sovereignty and geopolitical competition in the Arctic region.",
      "source": "FreeJobAlert",
      "importance": 4,
      "impact_to_me": 2,
      "category": "Global",
      "url": "https://www.freejobalert.com/article/school-assembly-news-headlines-today-29th-august-2025-top-national-world-sports-and-business-news-16221"
    },
    {
      "headline": "Parents in California blame ChatGPT for teenager's death, sparking debates about technology use",
      "summary": "Following a tragic death, parents attribute their teenager's demise to ChatGPT usage, igniting broader discussions regarding AI safety, technology regulation, and the mental health impact of digital tools.",
      "source": "Jagran Josh",
      "importance": 3,
      "impact_to_me": 3,
      "category": "Technology",
      "url": "https://www.jagranjosh.com/articles/school-assembly-news-headlines-today-29th-august-2025-stay-updated-with-important-news-headlines-of-national-international-and-other-important-updates-1800002567-1"
    }
  ]
}