{
  "weekly_top_story": {
    "headline": "Germany’s Future Military Support to Ukraine Hinges on US Involvement, Chancellor Merz Says",
    "summary": "Germany has announced that its continued military support for Ukraine will depend heavily on the United States’ involvement, with Europe prepared to guarantee security once a negotiated resolution to the conflict is reached, signaling potential shifts in Western military aid dynamics.",
    "source": "Leverage Edu",
    "importance": 5,
    "impact_to_me": 4,
    "category": "Global",
    "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-6-september-2025/"
  },
  "stories": [
    {
      "headline": "Thailand Elects Anutin Charnvirakul as New Prime Minister Amid Political Changes",
      "summary": "Thailand's parliament has elected business leader Anutin Charnvirakul as prime minister, marking the country's third leadership change in two years, which may influence regional stability and Southeast Asian policy directions.",
      "source": "Indian Express",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://indianexpress.com/article/education/school-assembly-news-today-september-6-pm-modi-punjab-floods-shivraj-chouhan-thailand-prime-minister-ukraine-amit-mishra-new-vande-bharat-delhi-jodhpur-nirf-rankings-2025-top-colleges-10230055/"
    },
    {
      "headline": "Pakistan Evacuates Over 100,000 People Due to Flooding Threat from India’s Dam Water Release",
      "summary": "Authorities in Pakistan's Sindh province evacuated more than 100,000 residents from vulnerable areas along the Indus River after India warned of potential cross-border flooding caused by upstream dam water releases, highlighting ongoing water security challenges in South Asia.",
      "source": "ABC News",
      "importance": 4,
      "impact_to_me": 4,
      "category": "Global",
      "url": "https://abcnews.go.com/International"
    },
    {
      "headline": "US Imposes Visa Restrictions on Central Americans Accused of Supporting Chinese Communist Party Influence",
      "summary": "The US government announced new visa restrictions targeting Central American nationals accused of acting on behalf of the Chinese Communist Party, aiming to counter rising CCP influence and uphold rule of law in the region.",
      "source": "Leverage Edu",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-6-september-2025/"
    }
  ]
}