{
  "weekly_top_story": {
    "headline": "PM Modi meets Chinese President Xi Jinping to reset ties amid trade tensions",
    "summary": "In a significant diplomatic engagement during the SCO summit, India’s PM Modi and China’s President Xi Jinping emphasized border peace, global stability, and cooperation to ease escalating trade tensions between their countries and the impact of US tariffs, signaling a strategic attempt to stabilize regional and global economic relations.",
    "source": "India Today",
    "importance": 5,
    "impact_to_me": 4,
    "category": "Global",
    "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/top-news-headlines-for-school-assembly-september-1-2779657-2025-09-01"
  },
  "stories": [
    {
      "headline": "PM Modi holds bilateral meeting with Myanmar military chief Min Aung Hlaing on SCO sidelines",
      "summary": "Amid growing regional security challenges, PM Modi met Myanmar’s acting President and military chief to engage on key bilateral and multilateral issues, reflecting India’s sustained diplomatic efforts to manage ties with neighboring countries during geopolitical shifts.",
      "source": "Economic Times",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://economictimes.com/news/new-updates/school-assembly-news-headlines-for-september-1-top-national-international-business-and-sports-update/articleshow/123615417.cms"
    },
    {
      "headline": "Heavy rains expected across northwest India in September, IMD issues warnings",
      "summary": "India Meteorological Department forecasts increased rainfall across northwest India including Uttarakhand, Delhi, and Rajasthan this month, prompting flood preparedness and potential impacts on agriculture and daily life amid ongoing climate variability.",
      "source": "Economic Times",
      "importance": 4,
      "impact_to_me": 4,
      "category": "Global",
      "url": "https://economictimes.com/news/new-updates/school-assembly-news-headlines-for-september-1-top-national-international-business-and-sports-update/articleshow/123615417.cms"
    }
  ]
}