{
  "weekly_top_story": {
    "headline": "Poland shoots down Russian drones, marking NATO’s first direct action on Moscow's assets during Ukraine war",
    "summary": "Polish forces intercepted multiple Russian drones violating its airspace, leading to European leaders condemning the attacks as unprecedented and escalating NATO tensions near conflict levels unseen since World War II.",
    "source": "Leverage Edu",
    "importance": 5,
    "impact_to_me": 5,
    "category": "Global",
    "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-11-september-2025/"
  },
  "stories": [
    {
      "headline": "Poland intercepts and shoots down multiple Russian drones, heightening NATO security alert",
      "summary": "Poland shot down 19 Russian drones after airspace violations, causing damage to residential buildings and triggering NATO's heightened alert, marking a critical moment in European security dynamics.",
      "source": "CNN 10",
      "importance": 5,
      "impact_to_me": 4,
      "category": "Global",
      "url": "https://www.youtube.com/watch?v=hP_06ScHpfk"
    },
    {
      "headline": "Violent protests erupt in France with nearly 200 arrested amid political tensions",
      "summary": "Massive demonstrations against President Macron’s new Prime Minister led to violent clashes and widespread arrests, reflecting deep internal unrest amid political transitions in France.",
      "source": "Leverage Edu",
      "importance": 3,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-11-september-2025/"
    },
    {
      "headline": "Nepal imposes extended curfew and deploys army amidst escalating deadly unrest",
      "summary": "Following protests over corruption that killed over 20 people and widespread violence, the Nepali Army has extended curfews and patrols in Kathmandu to restore order.",
      "source": "Leverage Edu",
      "importance": 3,
      "impact_to_me": 2,
      "category": "Global",
      "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-11-september-2025/"
    }
  ]
}