{
  "weekly_top_story": {
    "headline": "Typhoon Matmo makes landfall in Southern China with significant evacuations",
    "summary": "Typhoon Matmo struck Guangdong Province prompting the evacuation of nearly 370,000 people and large-scale safety measures, highlighting increasing global weather volatility and disaster preparedness challenges.",
    "source": "Leverage Edu",
    "importance": 5,
    "impact_to_me": 4,
    "category": "Global",
    "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-6-october-2025/"
  },
  "stories": [
    {
      "headline": "Israel intercepts flotilla heading to Gaza, taking custody of over 450 international activists",
      "summary": "Israeli naval forces intercepted about 40 aid boats near Gaza, securing the safety of over 450 activists amid ongoing regional tensions, reflecting complexities in humanitarian efforts.",
      "source": "Leverage Edu",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-6-october-2025/"
    },
    {
      "headline": "Continuous rainfall causes landslides in Eastern Nepal, with major activity in Ilam district",
      "summary": "Persistent heavy rain led to multiple landslides in Eastern Nepal, especially Ilam district, prompting coordinated rescue and relief efforts to ensure safety.",
      "source": "Leverage Edu",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-6-october-2025/"
    },
    {
      "headline": "Air India flight to UK grounded after emergency engine deployment shortly after takeoff",
      "summary": "An Air India flight bound for the UK was grounded following an emergency engine issue just after takeoff, raising important aviation safety concerns.",
      "source": "Jagran Josh",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Technology",
      "url": "https://www.jagranjosh.com/articles/school-assembly-news-headlines-today-6th-october-2025-an-air-india-flight-bound-for-the-uk-was-grounded-and-other-important-news-1800003825-1"
    }
  ]
}