{
  "weekly_top_story": {
    "headline": "Xi Jinping and Vladimir Putin Discuss Immortality and Organ Transplants During China's Largest Military Parade",
    "summary": "During the recent Beijing military parade, Chinese President Xi Jinping and Russian President Vladimir Putin reportedly discussed advancements in organ transplants and longevity, reflecting a shared interest in medical innovation with global implications for aging and health.",
    "source": "Leverage Edu",
    "importance": 5,
    "impact_to_me": 4,
    "category": "Science",
    "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-5-september-2025/"
  },
  "stories": [
    {
      "headline": "UAE Warns Israeli West Bank Annexation Would Break Abraham Accords",
      "summary": "The UAE officially warned that any annexation of West Bank territory by Israel would violate the Abraham Accords, threatening diplomatic relations and regional stability.",
      "source": "Leverage Edu",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-5-september-2025/"
    },
    {
      "headline": "Taxi Strike in Durban Ends After Three Days of Commute Disruptions",
      "summary": "A prolonged taxi strike that stranded thousands of commuters in Durban has been called off, restoring transportation services critical to daily life and local economy.",
      "source": "SABC News",
      "importance": 3,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://www.youtube.com/watch?v=S0GbDzBtYg4"
    },
    {
      "headline": "Hawaii’s Kilauea Volcano Erupts, Shooting Lava Into the Air",
      "summary": "The Kilauea volcano in Hawaii has resumed erupting, sending lava into the air and raising concerns about potential impacts on local communities and tourism.",
      "source": "Global News",
      "importance": 4,
      "impact_to_me": 2,
      "category": "Science",
      "url": "https://globalnews.ca/video/11392434/global-news-morning-headlines-thursday-september-4-2025"
    }
  ]
}