{
  "weekly_top_story": {
    "headline": "Thailand's Constitutional Court removes Prime Minister Paetongtarn Shinawatra over ethical misconduct",
    "summary": "Thailand's Constitutional Court has dismissed PM Paetongtarn Shinawatra for constitutional violations related to a compromising phone call with Cambodia's Senate President, marking a significant political upheaval and uncertainty amid regional politics.",
    "source": "Leverage Edu",
    "importance": 5,
    "impact_to_me": 4,
    "category": "Global",
    "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-30-august-2025/"
  },
  "stories": [
    {
      "headline": "Two Microsoft employees fired after protest over company's ties with Israel",
      "summary": "Two Microsoft employees were dismissed following a protest inside the president’s office against the company’s ties with Israel, highlighting growing tensions around corporate political stances and employee activism.",
      "source": "Free Job Alert",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Business",
      "url": "https://www.freejobalert.com/article/school-assembly-news-headlines-today-30th-august-top-national-world-sports-and-business-news-16338"
    },
    {
      "headline": "China invites international leaders to 80th anniversary WWII military parade",
      "summary": "China has invited global leaders, including former Australian Premier Dan Andrews, to a military parade commemorating the 80th anniversary of the end of World War II, emphasizing Beijing's role in shaping global historical memory.",
      "source": "Free Job Alert",
      "importance": 4,
      "impact_to_me": 2,
      "category": "Global",
      "url": "https://www.freejobalert.com/article/school-assembly-news-headlines-today-30th-august-top-national-world-sports-and-business-news-16338"
    },
    {
      "headline": "Nepal reports over 600 cholera cases amid outbreak in Madhesh Province",
      "summary": "Nepal's National Public Health Laboratory confirmed a cholera outbreak with more than 600 infections and three deaths, underscoring urgent public health challenges in the region.",
      "source": "Leverage Edu",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-30-august-2025/"
    }
  ]
}