{
  "weekly_top_story": {
    "headline": "Israeli Prime Minister Netanyahu requests pardon amid ongoing corruption trial",
    "summary": "Israeli Prime Minister Benjamin Netanyahu submitted a pardon request to the Office of the President's legal department during his ongoing corruption trial, raising significant legal and political implications for Israel.",
    "source": "Leverage Edu",
    "importance": 5,
    "impact_to_me": 4,
    "category": "Global",
    "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-1-december-2025/"
  },
  "stories": [
    {
      "headline": "US President Donald Trump confirms recent call with Venezuelan leader Nicolas Maduro amid tensions",
      "summary": "Amid rising tensions between the US and Venezuela, President Donald Trump confirmed a recent phone call with Venezuelan leader Nicolas Maduro, while Caracas criticized US military preparations.",
      "source": "NDTV",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Global",
      "url": "https://www.ndtv.com/world-news"
    },
    {
      "headline": "India achieves major climate goals at UN COP30 summit, leading BASIC group and developing countries",
      "summary": "At the UN COP30 climate summit in Brazil, India achieved significant climate targets, strengthening its leadership role among developing nations and influencing global climate policy.",
      "source": "Leverage Edu",
      "importance": 5,
      "impact_to_me": 4,
      "category": "Science",
      "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-1-december-2025/"
    },
    {
      "headline": "Earthquake of magnitude 4.4 shakes Bajhang district in Nepal with no reported damage",
      "summary": "A moderate earthquake hit Nepal's Bajhang district causing tremors in western provinces but no casualties or damage have been reported.",
      "source": "Leverage Edu",
      "importance": 3,
      "impact_to_me": 2,
      "category": "Global",
      "url": "https://leverageedu.com/discover/school-education/school-assembly-news-headlines-1-december-2025/"
    }
  ]
}