{
  "weekly_top_story": {
    "headline": "Bangladesh Heads to Polls in High-Stakes General Election Amid Sporadic Violence and Tight Security",
    "summary": "Bangladesh's general election proceeds under tight security with reported violence, potentially shaping regional stability in South Asia as global powers including India monitor the outcome closely.",
    "source": "Sunday Guardian",
    "importance": 5,
    "impact_to_me": 3,
    "category": "Global",
    "url": "https://sundayguardianlive.com/news/school-assembly-news-headlines-today-february-13-top-national-business-news-sports-news-world-news-with-weather-updates-thought-of-the-day-170024/"
  },
  "stories": [
    {
      "headline": "Manila Ready to Monitor Border Peace Along Cambodia-Thailand Border",
      "summary": "The Philippines, as ASEAN chair, will lead monitoring of peace on the Cambodia-Thailand border while enhancing military cooperation with Cambodia, aiming to foster regional stability in Southeast Asia.",
      "source": "BERNAMA",
      "importance": 4,
      "impact_to_me": 2,
      "category": "Global",
      "url": "https://www.bernama.com/en/world/news.php?id=2523468"
    },
    {
      "headline": "Singapore’s Daren Tang Nominated for Second Term as WIPO Director-General",
      "summary": "Daren Tang's nomination for another term at the helm of the UN's World Intellectual Property Organization signals continuity in global IP policy amid evolving technological and creative challenges.",
      "source": "The Straits Times",
      "importance": 3,
      "impact_to_me": 2,
      "category": "Business",
      "url": "https://www.bernama.com/en/world/news.php?id=2523468"
    },
    {
      "headline": "US House Blocks Proposed Canada Tariffs in Bipartisan Vote",
      "summary": "A bipartisan US House decision rejects President Trump's proposed tariffs on Canada, averting potential trade disruptions and highlighting congressional checks on executive trade policies.",
      "source": "Sunday Guardian",
      "importance": 4,
      "impact_to_me": 3,
      "category": "Business",
      "url": "https://sundayguardianlive.com/news/school-assembly-news-headlines-today-february-13-top-national-business-news-sports-news-world-news-with-weather-updates-thought-of-the-day-170024/"
    }
  ]
}